CREATE DATABASE  IF NOT EXISTS `pufar` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `pufar`;
-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: pufar
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `dialoges`
--

DROP TABLE IF EXISTS `dialoges`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `dialoges` (
  `dialog_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `user_sender_id` bigint(20) NOT NULL,
  `user_receiver_id` bigint(20) NOT NULL,
  `message` varchar(500) NOT NULL,
  `date` mediumtext,
  PRIMARY KEY (`dialog_id`),
  KEY `dialoges_users_user_id_fk` (`user_sender_id`),
  KEY `dialoges_users_user_id_fk_2` (`user_receiver_id`),
  CONSTRAINT `dialoges_users_user_id_fk` FOREIGN KEY (`user_sender_id`) REFERENCES `users` (`user_id`),
  CONSTRAINT `dialoges_users_user_id_fk_2` FOREIGN KEY (`user_receiver_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=244 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dialoges`
--

LOCK TABLES `dialoges` WRITE;
/*!40000 ALTER TABLE `dialoges` DISABLE KEYS */;
INSERT INTO `dialoges` VALUES (1,1,2,'hi',NULL),(2,1,2,'can a saw u any time ago ?',NULL),(3,1,2,'???)))',NULL),(4,2,1,'my be at the summer fast in Piter)',NULL),(5,3,2,'hi',NULL),(6,1,2,'-100r and i will by',NULL),(7,3,1,'want bye sofa',NULL),(8,2,3,')) 50',NULL),(9,3,2,'okay, call me latter +375259550317',NULL),(10,1,2,'where are u?',NULL),(11,2,1,'ok, u can by',NULL),(12,3,2,'hello))',NULL),(14,1,2,'ещё потестим',NULL),(15,1,2,'Efegfge2343435',NULL),(16,1,2,'лотерея пятёрочка',NULL),(17,1,2,'ты серьёзно?',NULL),(18,1,2,'777',NULL),(19,1,2,'rgg',NULL),(20,1,2,'всё решено',NULL),(22,1,2,'2424',NULL),(23,1,2,'ну, братишка, ты попал',NULL),(24,1,2,'я уже выезжаю',NULL),(25,1,2,'всё топчик работает',NULL),(26,1,2,'я ебвал твою жену',NULL),(27,1,2,'54654',NULL),(28,1,2,'тратат та ',NULL),(29,1,2,'egdrgr',NULL),(30,1,2,'drthj dkj fykd y',NULL),(31,1,2,'яероыовна ок ылл ',NULL),(32,1,2,'ю.ж.ю.*/-+',NULL),(33,1,2,'якрчео нал л нл нллн   ',NULL),(34,1,2,'<scripdt>Egfggg',NULL),(35,1,2,'eegegrh<scriptth>',NULL),(36,1,2,'aaaaM<scriptdfgrg>aaaa',NULL),(37,1,2,'egrgrgr',NULL),(38,1,2,'кпкпк',NULL),(39,1,2,'efef',NULL),(42,1,13,'хай',NULL),(43,1,17,'здарова',NULL),(44,1,2,'5',NULL),(45,1,2,'ты серьёзно?',NULL),(46,1,2,'лотерея пятёрочка',NULL),(47,1,13,'ну что южик',NULL),(48,1,13,'пришёл и твой конец',NULL),(49,1,13,'держи пипиську',NULL),(50,1,3,'в пизду её себя засунь, дятел',NULL),(51,1,3,'рпив',NULL),(52,1,3,'ыфрефрефу',NULL),(53,1,3,'ывоефеео',NULL),(54,1,3,'ынкокыноыкнкы',NULL),(55,1,3,'ыеыеоеое',NULL),(56,1,3,'теперь буду писать норм',NULL),(57,1,3,'петюня))',NULL),(58,1,3,'чуюня',NULL),(59,1,3,'Х',NULL),(60,1,3,'йцукенгшщзждлорпавыф',NULL),(61,1,3,'ячсмитьбю.эдъ',NULL),(62,1,3,'зъ',NULL),(63,1,17,'привет, ало блять, отвечай, пиздюк',NULL),(64,1,3,'[]',NULL),(65,1,3,'xxxXXxx',NULL),(66,1,13,'rtgrgr',NULL),(67,1,3,'1234567890-=qwertyuiop[]\\\';lkjhgfdsazxcvbnm,,./',NULL),(68,1,3,'!@#$%^&*()_+|}{POIUYTREWQASDFGHJKL:\"x<>><NMBVCXZ',NULL),(69,1,3,'1234567890-=',NULL),(70,1,3,'!\"№;%:x*()_+',NULL),(71,1,3,'x',NULL),(72,1,13,'1',NULL),(73,1,17,'2',NULL),(74,1,2,'3',NULL),(75,1,3,'4',NULL),(76,1,13,'rrgrg',NULL),(77,1,3,'efef',NULL),(78,1,13,'tht',NULL),(79,1,13,'arheaeahherthert',NULL),(80,1,13,'arheaeahherthert',NULL),(81,1,13,'arheaeahherthert',NULL),(82,1,13,'arheaeahherthert',NULL),(83,1,13,'arheaeahherthert',NULL),(84,1,13,'erggrg',NULL),(85,1,17,'egererg',NULL),(86,1,3,'ryjrjy',NULL),(87,1,2,'thtt',NULL),(88,1,17,'yjjjyj',NULL),(89,1,13,'eerteth',NULL),(90,1,13,'ththht',NULL),(91,1,3,'deyjdyyd',NULL),(92,1,3,'ты лошара',NULL),(93,1,3,'qwertyuiop;\']lkjhgfdsazxcvbnm,.///*-+',NULL),(94,1,3,'фмсчячмситьбю.дэжлрароваффййукешгеншщззъ**-+ЙЦЙЕНМПЧУСКОЙШТЙЦУАУПП,ЗЩЕ,ЭЬЕЪ',NULL),(95,1,3,'Ъ',NULL),(96,1,3,'Х',NULL),(97,1,3,'чччXXxxxxXX',NULL),(100,1,3,'efgergупкаукпкп',NULL),(102,1,3,'efegупапккп',NULL),(103,1,13,'я еду в трамвае',NULL),(104,1,3,'трататат х пися',NULL),(105,1,3,'я пишу на руском хуй',NULL),(106,1,13,'южиккккххх)',NULL),(107,1,3,'rgrghппекр',NULL),(108,1,13,'кпк',NULL),(109,1,13,'яяяяяюююю',NULL),(110,1,3,'www',NULL),(111,1,3,'сосни письку',NULL),(112,12,3,'уауа',NULL),(113,13,1,'готов отсосать вашу письку',NULL),(114,1,13,'да , я знал',NULL),(115,1,13,'брат приезжай, каменогорская 17',NULL),(116,1,3,'петушок',NULL),(117,1,13,'тоже петушок',NULL),(118,1,13,'1111',NULL),(119,1,13,'1',NULL),(127,1,3,'111','1545390204764'),(128,1,3,'3434','1545390211837'),(129,1,3,'3434','1545390263945'),(130,1,3,'ну воти всё','1545390271599'),(131,1,2,'1','1545390280293'),(132,1,1,'пишу сам себе','1545665166209'),(133,1,3,'пишу пете','1545665179034'),(134,1,2,'пишу васе','1545665195196'),(135,1,17,'пишу писе','1545665201608'),(136,1,13,'пишу юже','1545665210653'),(137,1,1,'пишу Андрею (сам себе)','1545665227271'),(138,13,1,'от южи к андрею','1545665345066'),(139,13,3,'от южи к пете','1545665423113'),(140,1,1,'xaii','1545681822047'),(141,1,1,'1','1545737332433'),(142,1,1,'пккпрк','1545737353602'),(143,1,1,'пишу сам себе','1545738029035'),(144,1,13,'южа хай','1545738094203'),(145,1,1,'пишу сам себе','1545748107480'),(147,1,1,'сам себе','1545750274571'),(148,1,1,'343укуау','1545750350418'),(149,1,1,'уука','1545750454275'),(150,1,13,'пкк','1545750461386'),(151,1,1,'теперь ок','1545750475323'),(152,1,1,'пишу сам себе','1545750985058'),(153,1,1,'ч','1545751000611'),(154,1,1,'ч','1545751013970'),(155,1,1,'AnDreI','1545751059570'),(156,1,1,'привет','1545751501170'),(157,1,1,'пишу сам себе','1545751539579'),(158,1,1,'х','1545751545615'),(162,22,1,'22','1545751984831'),(163,22,1,'efefef','1545751995773'),(164,1,1,'11111','1545752051449'),(165,1,13,'южа','1545752058878'),(166,22,13,'343','1545752074803'),(167,22,13,'23','1545752079397'),(168,22,1,'привет андрей','1545752103312'),(169,21,1,'34','1545752231233'),(170,21,1,'34ff4','1545752238044'),(171,21,13,'erfgrgrtg','1545752247758'),(172,21,13,'rgrtgrtgtg','1545752256712'),(173,1,1,'пишу сам себе','1545752583233'),(176,1,1,'привет','1545752780020'),(177,22,1,'х','1545752801948'),(178,22,1,'х','1545752803526'),(179,22,1,'х','1545752805987'),(180,22,13,'4','1545752813061'),(181,22,22,'4','1545752961631'),(182,22,13,'4','1545752972721'),(183,22,22,'привет','1545753126038'),(184,22,22,'ghb','1545753709526'),(185,22,1,'1','1545753715212'),(186,22,13,'2','1545753718279'),(187,1,22,'1','1545753760973'),(188,1,1,'1','1545931212969'),(189,1,1,'2','1545931296869'),(190,1,1,'gbcz','1546015842168'),(191,1,1,'пися','1546015845246'),(192,1,1,'111','1546025307013'),(193,1,22,'234','1546085139229'),(194,1,21,'x','1546085144231'),(195,32,22,'12','1546085171713'),(196,32,22,'12','1546085179110'),(197,32,22,'14','1546085188440'),(198,36,22,'1','1546085213882'),(199,36,13,'[fq .;f','1546085228588'),(200,36,13,'хай южа','1546085232840'),(201,36,13,'23','1546085417152'),(202,36,13,'2','1546085425380'),(203,36,22,'5','1546085429424'),(204,36,13,'3','1546085442402'),(205,36,22,'3','1546085445476'),(206,36,22,'4','1546085448188'),(207,1,13,'333','1546106058183'),(208,1,1,'34','1546424023766'),(209,1,1,'1234567890-=','1546424058374'),(216,1,1,'213','1546425644825'),(217,1,13,'33','1546425647306'),(218,1,13,'33','1546425650494'),(219,1,1,'535','1546425674889'),(220,1,1,'1','1546425715342'),(223,1,1,'232','1546425724804'),(225,1,1,'454','1546425857491'),(226,1,1,'3545','1546425860306'),(227,1,1,'ПРИВЕТ','1546425958782'),(229,1,1,'ахуеть','1546425991487'),(234,1,1,'УАУКППКПРЕ','1546426073462'),(239,1,3,'xxxx','1546426166822'),(240,1,1,'123','1546527714551'),(241,1,1,'3','1546527717814'),(242,1,1,'23','1546531540593'),(243,1,1,'33','1546531543335');
/*!40000 ALTER TABLE `dialoges` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-01-03 19:19:57
